export const links = {
  terms: "https://example.com/terms",
  fightersRequestForm: "https://forms.gle/application-form",
  fightersTrainingForm: "https://forms.gle/training-form",
  donationsLinkOne: "https://example.com/donate1",
  donationsLinkTwo: "https://example.com/donate2",
  donationsForm: "https://forms.gle/donations-form",
};

export const messages = {
  back: "Назад",

  forFighters: "Для бойцов",
  forViewers: "Для зрителей",
  premiumClub: "Закрытый клуб",
  supportProject: "Поддержать проект",

  fightersInfo: "Информация (бойцы)",
  submitApplication: "Подать заявку",
  trainingFights: "Тренировочные бои",

  viewersInfo: "Информация (зрители)",
  viewersEvents: "Ивенты",
  viewersTickets: "Покупка билетов",
};

export const botTexts = {
  welcome: `👊 Добро пожаловать! Этот бот для пиздилок (Артем Натурал неГЕЙмер).\n\nСледите за нами в соцсетях:\n🌐 [Instagram](https://instagram.com/)\n📱 [TikTok](https://t.me/)`,

  fightersPreview: `💪 Раздел для бойцов.\nЗдесь ты можешь узнать все о боях и тренировках.`,
  fightersInfo: `Если вы уверены в своих силах, то вы можете принять участие в боях за денежные награды! В боях могут принять участие все желающие, не важно - любитель вы или профессиональный боец.\n\n🤜 *КАК СТАТЬ БОЙЦОМ?* 🤛\n1) Вы заполняете анкету в телеграм боте или на сайте, указывая все запрашиваемые в анкете данные\n2) С Вами в течении суток связываются и доводят необходимую информацию.\n\n*ОТ ЧЕГО ЗАВИСИТ РАЗМЕР ДЕНЕЖНОЙ НАГРАДЫ ЗА БОЙ?*\nПеред тем как принять участие в бою, Вы вносите оговариваемый лично с Вами бойцовский взнос, в случае вашей победы вы получаете сумму в два раза больше внесенной. Помимо этого, если Вы ярко провели бой и не важно, выиграли Вы или проиграли, Вы можете получить денежное вознаграждение или иную награду от спонсоров. Бойцы ярко проводящие свои бои могут получить возможность поучаствовать в одном из боев вечера, где Вы без каких-либо взносов принимаете участие в бою вечера, и в случае победы получаете денежное вознаграждение лично от организаторов. А также, отличившиеся по мнению организаторов бойцы, могут в любой момент получить клубную карту и стать членами клуба, что в свою очередь откроет возможность принимать участие в закрытых мероприятиях и получать дополнительные бонусы.\n\n*КАК ПОДБИРАЮТСЯ ОППОНЕНТЫ?*\nОппоненты подбираются согласно уровню навыков, исходя из данных, указанных в анкете, физическим данным и непосредственно продемонстрированным навыкам. (Бойцы, предоставившие не достоверные данные и пытающиеся скрыть свой реальный уровень навыков с целью получить в соперники более слабого оппонента, будут лишены взноса и исключены из клуба навсегда!).\n\n*ПО КАКИМ ПРАВИЛАМ ПРОВОДЯТСЯ БОИ?*\nБои проводятся по правилам ММА, за исключением отдельных мероприятий.\n\n*ЧТО Я МОГУ ПОЛУЧИТЬ ПОМИМО ДЕНЕГ И АДРЕНАЛИНА?*\nУчаствуя у нас в боях, вы можете приобрести определённый опыт и заявить о себе, что в свою очередь поможет вам проложить дорогу в различные бойцовские организации.`,
  fightersRequest: `📜 Подавая форму заявки, вы принимаете условия о том, что вам разобъют лицо и вы жестко пострадаете... короче соглашаетесь с этим нани по ссылке:\n [УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ И ДОГОВОР СОГЛАСИЯ НА БОЙ](${links.terms})\n\n📋 Подать заявку на бой можно через форму ниже:\n [ФОРМА ЗАЯВКИ НА БОЙ](${links.fightersRequestForm})`,
  fightersTraining: `🤼 Хотите подраться на ринге и понять готовы ли вы к реальному выступлению? почувствовать себя в роли бойца? Выпустить пар? Решить конфликт, который не решается словами? Помериться с кем-то силами? Мы можем все это для вас организовать! Что собой представляют индивидуальные бои?\n\nБК "ЦЕПЬ" предоставляет Вам и вашему товарищу/товарищам (либо же случайно подобранному человеку с подобными Вам целями, изъявившему желание выйти на ринг) помещение клуба для проведения боя сроком от одного часа, услуги рефери, медицинский надзор и бойцовскую экипировку (перчатки, шорты, капу. Шлем и щитки на ноги по желанию). В этот час Вы можете работать на ринге как Вам того захочется, будь то лёгкий спаринг или же полноценный бой по любым правилам единоборств.\n\n*КАК ПРИНЯТЬ УЧАСТИЕ В ИНДИВИДУАЛЬНЫ БОЯХ?*\nПросто отправьте свой номер телефона в форме по ссылке ниже и ожидайте звонка, в ближайшее время с вами обязательно свяжутся и все расскажут!\n\n*КТО МОЖЕТ ПРИСУТСТВОВАТЬ НА БОЕ?*\nТолько рефери, медик и те, кого Вы захотите взять с собой.\n\n*СКОЛЬКО СТОИТ УЧАСТИЕ В ИНДИВИДУАЛЬНЫХ БОЯХ?*\nОдин час индивидуальных боев стоит 100р, вне зависимости от количества людей которых Вы берете с собой.\n\n🥊 *Форма тренировочных боев доступна по ссылке:* \n[ФОРМА ЗАЯВКИ НА ТРЕНИРОВОЧНЫЙ БОЙ](${links.fightersTrainingForm})`,

  viewersPreview: `👀 Раздел для зрителей.\nЗдесь ты можешь узнать все о предстоящих боях и как их посетить.`,
  viewersInfo: `Если вы хотите посетить наши мероприятия в качестве зрителя, то вам необходимо приобрести билет на одно из предстоящих мероприятий. Билеты можно приобрести в этом телеграм боте.\n\n*Купить билеты можно только онлайн*\n\n*Строго 18+*`,
  viewersEvents: `*Как заработать будучи зрителем?*\nВ конце каждого бойцовского вечера, ведущий предлагает любым желающим из зала выйти на ринг и подраться, победитель боя получит денежное вознаграждение от организаторов (от 100 до 300 долларов). Если желающих из зала будет более двух, то проводится жеребьёвка, по результатам которой останутся два человека - которые и выйдут на ринг, драться за награду.\n\nУчтите, что желающие из зала выбираются абсолютно случайно, на ринг против Вас может выйти как подготовленный боец, так и абсолютный новичок, абсолютно разной весовой категории и роста, поэтому, перед тем как изъявить желание выйти на бой, призываем Вас тщательно все обдумать и грамотно оценить свои силы\n\n*ВСЕ БОИ ПРОВОДЯТСЯ ПО ПРАВИЛАМ ММА*`,

  premiumClub: `🔒 Закрытый клуб.\nИнформация о доступе и условиях:\n\n*КАК СТАТЬ ЧЛЕНОМ КЛУБА?*\nДля того чтобы стать членом клуба и получить клубную карту Вам необходимо посетить 10 бойцовских мероприятий в бойцовском клубе. В конце каждого мероприятия ведущий будет предлагать заполнить анкету на получение клубной карты (анкета заполняется единожды), в дальнейшем, тем кто заполнил анкету, после каждого мероприятия ведущий будет выдавать номерную карту мероприятия. Когда Вы получите 10 номерных карт мероприятий, Вы сможете обменять их на клубную карту, официально станете членом клуба.\n\n*ЧТО ДАЁТ ЧЛЕНСТВО В КЛУБЕ?*\nЧлены клуба получают уникальные бонусы, доступ к закрытым боям и мероприятиям\n\n*ЕСТЬ ЛИ ДРУГИЕ СПОСОБЫ ПОЛУЧЕНИЯ КЛУБНОЙ КАРТЫ?*\nДа, клубные карты могут быть выданы лично организаторами, людям, значительно поддержавшим проект, тем самым внесшим вклад в развития бойцовского клуба. Клубные карты также могут получить бойцы, которые смогут проявить себя, что откроет им доступ к определённым закрытым мероприятиям и дополнительным бонусам.`,

  donation: `🎁 Вы можете поддержать проект или стать его спонсором!\n\nСсылки для донатов:\n[ДОНАТ Сбербанк](${links.donationsLinkOne})\n[ДОНАТ Альфабанк](${links.donationsLinkTwo})\n\n💰 Хотите стать спонсором проекта? Оставьте свою заявку по ссылке:\n[ФОРМА ДЛЯ СПОНСОРА](${links.donationsForm})`,

  noTickets: `🎟 К сожалению, на ближайшие мероприятия билетов больше нет.`,

  availableFights: `🎟 Доступные к посещению мероприятия:\n\n`,

  error: `❗️ Произошла ошибка. Попробуйте снова.`,
};

export const keyboards = {
  main: [
    [messages.forFighters, messages.forViewers],
    [messages.premiumClub, messages.supportProject],
  ],

  fighters: [
    [messages.back, messages.fightersInfo],
    [messages.submitApplication, messages.trainingFights],
  ],

  viewers: [
    [messages.back, messages.viewersInfo],
    [messages.viewersEvents, messages.viewersTickets],
  ],

  justBack: [[messages.back]],
};
